[
	{
		"id": "1",
		"video": "Video path",
		"title": "Next.js Dashboard",
		"link": "/projects/1",
		"githubLink": "https://github.com/MiguelGFerreira/nextjs-dashboard",
		"mainImage": "/dashboard.png",
		"description": "A dashboard application built with React and Next.js",
		"sections": [
			{
				"type": "text",
				"content": "This project is a Next.js dashboard that I developed as part of the Next.js documentation. The dashboard is built using Next.js, React, TypeScript, and Tailwind. The dashboard includes a public home page, a login page, dashboard pages, and invoice management."
			},
			{
				"type": "image",
				"src": "/main-page-project1.png",
				"alt": "Screenshot of the main page"
			},
			{
				"type": "text",
				"content": "This project was a valuable learning experience for me. I learned how to use Next.js to build a complex web application. I also learned how to use React, TypeScript, and Tailwind to build a production-ready application."
			},
			{
				"type": "image",
				"src": "/invoices-page-project1.png",
				"alt": "Screenshot of invoices page"
			}
		],
		"features": [
			"A public home page",
			"A login page",
			"Dashboard pages",
			"Invoice management"
		]
	},
	{
		"id": "2",
		"video": "Video path",
		"title": "Car Showcase",
		"link": "/projects/2",
		"githubLink": "https://github.com/MiguelGFerreira/car_showcase",
		"mainImage": "/car-showcase.png",
		"description": "Project 2 description",
		"sections": [
			{
				"type": "text",
				"content": "Car Showcase is a website that showcases a variety of cars. It features cars from different manufacturers, models, and years. The website is built with React, Next.js, TypeScript, and Tailwind. This project was built follwing a tutorial."
			},
			{
				"type": "image",
				"src": "/car-showcase-cars.png",
				"alt": "Screenshot of the Next.js Dashboard"
			},
			{
				"type": "text",
				"content": "Implementing React and Next.js laid the groundwork for a dynamic and responsive user interface. Leveraging Typescript added a layer of robustness to the codebase, ensuring a seamless development process and minimizing potential errors. Tailwind CSS brought a touch of aesthetic finesse, allowing for a visually stunning presentation of the automotive world."
			},
			{
				"type": "text",
				"content": "Connecting to the Rapid API was a crucial aspect of Car Showcase. This integration allowed for real-time updates, ensuring that the website stays current with the ever-evolving automotive landscape. Fetching data on cars and images from the API created a dynamic platform that keeps users informed about the latest models and specifications."
			},
			{
				"type": "text",
				"content": "Creating an intuitive and user-friendly interface was at the forefront of the project. The implementation of filter options empowers users to customize their search based on specific criteria, providing a tailored experience for each visitor. This user-centric approach enhances the overall accessibility and engagement of the website."
			},
			{
				"type": "text",
				"content": "The inclusion of a fictional rental price calculator adds a unique dimension to Car Showcase. By dynamically calculating rental prices based on the parameters of each car, users get a glimpse into the potential cost of driving their dream vehicle. This innovative feature not only enhances the user experience but also sets Car Showcase apart in the competitive world of automotive websites."
			},
			{
				"type": "image",
				"src": "/car-showcase-box.png",
				"alt": "Screenshot of the Next.js Dashboard"
			},
			{
				"type": "text",
				"content": "In conclusion, Car Showcase is not just a portfolio project; it's a testament to my dedication to innovation and excellence in web development. I am proud of what I've accomplished, and I look forward to applying the skills and insights gained from this project to future endeavors."
			}
		],
		"features": [
			"Car listing",
			"Filter",
			"API connection",
			"Dynamic rental price"
		]
	}
]